---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ViewFailures
source: html/8aa2d60d-e642-4717-3c73-63e56e49f8ec.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures

Failures about ViewFailures.

## Syntax (C#)
```csharp
public static class ViewFailures
```